package com.bit.demo1;
import java.util.Scanner;
// 1. 소스 파일 1개, class 1개 정의
// 2. 클래스 안에 메서드(함수)들을 정의
//    - 함수는 동사(행위)들을 정의 : 하나의 기능(목적)
//    - 순서와 위치에 맞추어 조립하는 과정이 프로그래밍 !
// 3. 중첩 (안에 들어있는) 중괄호 잘 따라다니기!
//    - 닫히는 곳에 꼭 주석 붙이는 습관 가지기
// 4. 함수를 실행시킨다, 호출한다...
//    -> 함수명();
//    함수를 실행시키면서 전달한다...
//    -> 함수명(자료형 변수이름);
//    여러개 전달시
//    -> 함수명(  ,  ,  ,);
//    함수를 실행시킨다. 전달은 없고, 결과를 받는다.(반환)
//    -> 변수명 = 함수명();
//    함수를 실행시킨다. 전달은 있고, 결과를 받는다. (반환)
//    -> 변수명 = 함수명(자료형 변수);
// 5. 함수를 실행시킨다... 이 함수가 A의 함수다...
//    -> A.함수명();    Ex) scanner.nextInt(); -> 객체 A가 가진 함수를 실행시킨다... 요청한다...
//


public class Main {


	
	public static void main(String[] args) {
		//화면에 출력한다. 글자들이 보이게 만들어라.
		// 출력하기- 함수찾기
		// 그 중에 화면에 출력하는 것
		System.out.println("안녕");

	}
	


}
